#### terraform init `success`
#### terraform plan `success`

<details>
  <summary>Plan Result</summary>
  ```google_compute_network.test-network: Refreshing state... [id=projects/learn-terraform-322811/global/networks/test-network]
google_project_service.project["iam.googleapis.com"]: Refreshing state... [id=learn-terraform-322811/iam.googleapis.com]
google_service_account.cloud-run-sa: Refreshing state... [id=projects/learn-terraform-322811/serviceAccounts/cloud-run-sa@learn-terraform-322811.iam.gserviceaccount.com]
google_project_service.project["sqladmin.googleapis.com"]: Refreshing state... [id=learn-terraform-322811/sqladmin.googleapis.com]
google_project_service.project["run.googleapis.com"]: Refreshing state... [id=learn-terraform-322811/run.googleapis.com]
google_project_service.project["containerregistry.googleapis.com"]: Refreshing state... [id=learn-terraform-322811/containerregistry.googleapis.com]
google_project_service.project["compute.googleapis.com"]: Refreshing state... [id=learn-terraform-322811/compute.googleapis.com]
google_cloud_run_service.cloud-run-test: Refreshing state... [id=locations/asia-northeast1/namespaces/learn-terraform-322811/services/cloud-run-test]
google_project_iam_member.cloud-run-agent-iam: Refreshing state... [id=learn-terraform-322811/roles/run.serviceAgent/serviceAccount:cloud-run-sa@learn-terraform-322811.iam.gserviceaccount.com]
google_compute_subnetwork.test-subnetwork1: Refreshing state... [id=projects/learn-terraform-322811/regions/asia-northeast1/subnetworks/test-subnetwork1]
google_compute_firewall.test-firewall: Refreshing state... [id=projects/learn-terraform-322811/global/firewalls/test-firewall]
google_compute_instance.test-server: Refreshing state... [id=projects/learn-terraform-322811/zones/asia-northeast1-b/instances/test-server]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_service.cloud-run-test will be updated in-place
  ~ resource "google_cloud_run_service" "cloud-run-test" {
        id                         = "locations/asia-northeast1/namespaces/learn-terraform-322811/services/cloud-run-test"
        name                       = "cloud-run-test"
        # (4 unchanged attributes hidden)


      ~ template {
          ~ metadata {
              ~ annotations = {
                  - "autoscaling.knative.dev/maxScale" = "100"
                  - "run.googleapis.com/sandbox"       = "gvisor"
                } -> (known after apply)
                # (2 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_project_iam_member.sql-for-cloud-run-iam will be created
  + resource "google_project_iam_member" "sql-for-cloud-run-iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:cloud-run-sa@learn-terraform-322811.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/cloudsql.client"
    }

  # google_sql_database.cloud-sql-test-db will be created
  + resource "google_sql_database" "cloud-sql-test-db" {
      + charset   = (known after apply)
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = "cloud-sql-test-instance"
      + name      = "cloud-sql-test-db"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

  # google_sql_database_instance.cloud-sql-test-instance will be created
  + resource "google_sql_database_instance" "cloud-sql-test-instance" {
      + connection_name               = (known after apply)
      + database_version              = "MYSQL_8_0"
      + deletion_protection           = true
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = "cloud-sql-test-instance"
      + private_ip_address            = (known after apply)
      + project                       = (known after apply)
      + public_ip_address             = (known after apply)
      + region                        = "asia-northeast1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy           = (known after apply)
          + authorized_gae_applications = (known after apply)
          + availability_type           = "ZONAL"
          + crash_safe_replication      = (known after apply)
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = 1
          + disk_type                   = (known after apply)
          + pricing_plan                = "PER_USE"
          + replication_type            = (known after apply)
          + tier                        = "db-f1-micro"
          + user_labels                 = (known after apply)
          + version                     = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = (known after apply)
              + enabled                        = (known after apply)
              + location                       = (known after apply)
              + point_in_time_recovery_enabled = (known after apply)
              + start_time                     = (known after apply)
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings {
                  + retained_backups = (known after apply)
                  + retention_unit   = (known after apply)
                }
            }

          + ip_configuration {
              + ipv4_enabled    = (known after apply)
              + private_network = (known after apply)
              + require_ssl     = (known after apply)

              + authorized_networks {
                  + expiration_time = (known after apply)
                  + name            = (known after apply)
                  + value           = (known after apply)
                }
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

